import React from "react";
import Header from "../components/header";
import About from "../components/about";

const PolicyPage = () => {
    return (
        <div id="app" className="policy-page">
            <Header />

            <section>
                <h1>Политика конфиденциальности</h1>

                <div className="policy--item">
                    <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
                    <p>1. Настоящий документ определяет политику ИП "Samuryq Group" (далее – Компания) в отношении обработки персональных данных (далее – ПД).</p>
                    <p>2. Настоящая Политика разработана в соответствии с действующим законодательством Респубкили Казахстан о персональных данных.</p>
                    <p>3. Действие настоящей Политики распространяется на все процессы по сбору, записи, систематизации, накоплению, хранению, уточнению, извлечению, использованию, передачи (распространению, предоставлению, доступу), обезличиванию, блокированию, удалению, уничтожению персональных данных, осуществляемых с использованием средств автоматизации и без использования таких средств.</p>
                </div>
                
                <div className="policy--item">
                    <h2>2. ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
                    <p>Обработка персональных данных осуществляется на основе следующих принципов:</p>
                    <p>1. Обработка персональных данных осуществляется на законной и справедливой основе;</p>
                    <p>2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных;</p>
                    <p>3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместных между собой;</p>
                    <p>4. Обработке подлежат только те персональные данные, которые отвечают целям их обработки;</p>
                    <p>5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Обрабатываемые персональные данные не являются избыточными по отношению к заявленным целям обработки</p>
                    <p>6. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к заявленным целям их обработки;</p>
                    <p>7. Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных данных не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных. Обрабатываемые персональные данные подлежат уничтожению, либо обезличиванию по достижении целей обработки или в случае утраты необходимости в достижении этих целей, если иное не предусмотрено федеральным законом.</p>
                </div>

                <div className="policy--item">
                    <h2>3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
                    <p>1. Обработка персональных данных осуществляется с соблюдением принципов и правил, установленных законом «О персональных данных».</p>
                    <p>2. Компания может включать персональные данные субъектов в общедоступные источники персональных данных, при этом Компания берет письменное согласие субъекта на обработку его персональных данных.</p>
                    <p>3. Компания может осуществлять обработку специальных категорий персональных данных, касающихся состояния здоровья, при этом Компания обязуется брать письменное согласие субъекта на обработку его персональных данных.</p>
                    <p>4. Биометрические персональные данные (сведения, которые характеризуют физиологические и биологические особенности человека, на основании которых можно установить его личность и которые используются оператором для установления личности субъекта персональных данных) в Компании не обрабатываются.</p>
                    <p>5. Компания может осуществляет трансграничную передачу персональных данных только на территорию иностранных государств, обеспечивающих адекватную защиту прав субъектов персональных данных и только в порядке, не противоречащем законодательству РК.</p>
                    <p>6. Принятие на основании исключительно автоматизированной обработки персональных данных решений, порождающих юридические последствия в отношении субъекта персональных данных или иным образом затрагивающих его права и законные интересы, не осуществляется.</p>
                    <p>7. При отсутствии необходимости письменного согласия субъекта на обработку его персональных данных согласие субъекта может быть дано субъектом персональных данных или его представителем в любой позволяющей получить факт его получения форме.</p>
                    <p>8. Компания вправе поручить обработку персональных данных другому лицу с согласия субъекта персональных данных, если иное не предусмотрено законом, на основании заключаемого с этим лицом договора (далее – поручение оператора). При этом Компания в договоре обязует лицо, осуществляющее обработку персональных данных по поручению Компании, соблюдать принципы и правила обработки персональных данных, предусмотренные настоящим законом.</p>
                    <p>9. В случае если Компания поручает обработку персональных данных другому лицу, ответственность перед субъектом персональных данных за действия указанного лица несет Компания. Лицо, осуществляющее обработку персональных данных по поручению Компании, несет ответственность перед Компанией.</p>
                    <p>10. Компания обязуется и обязует иные лица, получившие доступ к персональным данным, не раскрывать третьим лицам и не распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено законом.</p>
                </div>

                <div className="policy--item">
                    <h2>4. МЕРЫ ПО ОБЕСПЕЧЕНИЮ БЕЗОПАСНОСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПРИ ИХ ОБРАБОТКЕ</h2>
                    <p>При обработке персональных данных Компания принимает необходимые правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных. Обеспечение безопасности персональных данных достигается, в частности:</p>
                    <p>1. определением угроз безопасности персональных данных при их обработке в информационных системах персональных данных;</p>
                    <p>2. применением организационных и технических мер по обеспечению безопасности персональных данных при их обработке в информационных системах персональных данных, необходимых для выполнения требований к защите персональных данных, исполнение которых обеспечивает установленные Правительством Респубкили Казахстан уровни защищенности персональных данных;</p>
                    <p>3. применением прошедших в установленном порядке процедуру оценки соответствия средств защиты информации;</p>
                    <p>4. оценкой эффективности принимаемых мер по обеспечению безопасности персональных данных до ввода в эксплуатацию информационной системы персональных данных;</p>
                    <p>5. учетом машинных носителей персональных данных;</p>
                    <p>6. обнаружением фактов несанкционированного доступа к персональным данным и принятием мер;</p>
                    <p>7. восстановлением персональных данных, модифицированных или уничтоженных вследствие несанкционированного доступа к ним;</p>
                    <p>8. установлением правил доступа к персональным данным, обрабатываемым в информационной системе персональных данных, а также обеспечением регистрации и учета всех действий, совершаемых с персональными данными в информационной системе персональных данных;</p>
                    <p>9. контролем за принимаемыми мерами по обеспечению безопасности персональных данных и уровня защищенности информационных систем персональных данных</p>
                </div>
            </section>

            <About />
        </div>
    );
}

export default PolicyPage;